# **1. Manipulação de Dados**

In [2]:
import pandas as pd
import seaborn as sns

## **1.1** - Adicionando e Modificando Colunas em um DataFrame
* Para adicionar uma nova coluna ao DataFrame basta atribuir ao rótulo da coluna desejada um valor padrão ou uma lista com os valores desejados.

*  Associando um valor padrão:


   1 - df[nome_coluna] = valor_padrao.
* Associando valores específicos para cada uma das linhas:

  1 - df[<novo rótulo >] = [<valor_1 >, <valor_2 >,...,<valor_n >]

In [3]:
novo_dict = {
    "Nomes":["Carlos", "Sandro", "Fernando"],
    "Idades": [21, 20, 22]
}
df = pd.DataFrame(novo_dict)
df

      Nomes  Idades
0    Carlos      21
1    Sandro      20
2  Fernando      22

## **1.1.1** - Associando um valor padrão

In [4]:
# Criando a tabela Profissão
df["Profissão"] = "Estudante"

In [5]:
df

      Nomes  Idades  Profissão
0    Carlos      21  Estudante
1    Sandro      20  Estudante
2  Fernando      22  Estudante

## **1.1.2** - Associando valores específicos para cada uma das linhas

In [6]:
# Criando a tabela email
df["E-mail"] = ["carlos@gmail.com", "sandro_santos@gmail.com", "fernandoFM@gmail.com"]

In [7]:
df

      Nomes  Idades  Profissão                   E-mail
0    Carlos      21  Estudante         carlos@gmail.com
1    Sandro      20  Estudante  sandro_santos@gmail.com
2  Fernando      22  Estudante     fernandoFM@gmail.com

## **1.1.3** - Adicionando linhas numa coluna especifica através de um método **_append()**.
* Primeiramente tens que criar uma lista, dentro dela pôr um dicionário{chave:valor}
* E depois usar o método _append() para adicionar a um outro **DataFrame**
* Sintaxe: dados = [{chave: valor, chave: valor...}, {chave: valor}]
* Depois usar o medetdo append no dataframe que queres adiocionar as novas linhas
* **D2 = df._append(dados, ignore_index = True)** o **ignore_index = True** ignorar os rotulos caso não sejam compatíveis.

In [8]:
dados = [{"Nomes": "Pedro", "Idades": 32, "Profissão": "Estudante", "E-mail": "peropp@gmail.com"},
         {"Nomes": "Jeovani", "Idades": 22, "Profissão": "Estudante", "E-mail": "jeovanijp972@gmail.com"}
        ]

df_2 = df._append(dados, ignore_index = True)
df_2

      Nomes  Idades  Profissão                   E-mail
0    Carlos      21  Estudante         carlos@gmail.com
1    Sandro      20  Estudante  sandro_santos@gmail.com
2  Fernando      22  Estudante     fernandoFM@gmail.com
3     Pedro      32  Estudante         peropp@gmail.com
4   Jeovani      22  Estudante   jeovanijp972@gmail.com

In [9]:
df.loc[df["Nomes"]== "Carlos"]

    Nomes  Idades  Profissão            E-mail
0  Carlos      21  Estudante  carlos@gmail.com

In [10]:
df_2.loc[df_2["Nomes"] == "Jeovani"]["Idades"]

4    22
Name: Idades, dtype: int64

In [11]:
df_2

      Nomes  Idades  Profissão                   E-mail
0    Carlos      21  Estudante         carlos@gmail.com
1    Sandro      20  Estudante  sandro_santos@gmail.com
2  Fernando      22  Estudante     fernandoFM@gmail.com
3     Pedro      32  Estudante         peropp@gmail.com
4   Jeovani      22  Estudante   jeovanijp972@gmail.com

In [12]:
def add_pessoas(nome, idade, profissao, email):
    add = [{"Nomes": nome, "Idades": idade, "Profissão": profissao, "E-mail": email}]
    return add
    
df_2 = df_2._append(add_pessoas("Francisco", 18, "Estudante", "francisco@gmail.com"), ignore_index = True)
df_2

       Nomes  Idades  Profissão                   E-mail
0     Carlos      21  Estudante         carlos@gmail.com
1     Sandro      20  Estudante  sandro_santos@gmail.com
2   Fernando      22  Estudante     fernandoFM@gmail.com
3      Pedro      32  Estudante         peropp@gmail.com
4    Jeovani      22  Estudante   jeovanijp972@gmail.com
5  Francisco      18  Estudante      francisco@gmail.com

## **1.1.4** - Modificando ou alternando linhas num DataFrame() 
* Os indexadores **loc** e **iloc** também podem ser utilizados para modificar uma linha já existente.
* Para isso, basta **atribuir os novos valores desejados** ou **um valor padrão.**
* O indexador **loc** também pode ser utilizado para adicionar uma nova linha no final do DataFrame de forma similar.

In [13]:
df_2

       Nomes  Idades  Profissão                   E-mail
0     Carlos      21  Estudante         carlos@gmail.com
1     Sandro      20  Estudante  sandro_santos@gmail.com
2   Fernando      22  Estudante     fernandoFM@gmail.com
3      Pedro      32  Estudante         peropp@gmail.com
4    Jeovani      22  Estudante   jeovanijp972@gmail.com
5  Francisco      18  Estudante      francisco@gmail.com

## Os indexadores **loc** e **iloc** também podem ser utilizados para modificar uma linha já existente.

In [14]:
## Com loc

## Tarefa: Alterar o email do pedro, está mal escrito.
df_2.loc[3,"E-mail"] = "pedropp@gmail.com"
df_2

       Nomes  Idades  Profissão                   E-mail
0     Carlos      21  Estudante         carlos@gmail.com
1     Sandro      20  Estudante  sandro_santos@gmail.com
2   Fernando      22  Estudante     fernandoFM@gmail.com
3      Pedro      32  Estudante        pedropp@gmail.com
4    Jeovani      22  Estudante   jeovanijp972@gmail.com
5  Francisco      18  Estudante      francisco@gmail.com

In [15]:
## Com iloc

## Tarfa: Mudar o nome do Francisco para Cisco
df_2.iloc[5,0] = "Cisco"
df_2

      Nomes  Idades  Profissão                   E-mail
0    Carlos      21  Estudante         carlos@gmail.com
1    Sandro      20  Estudante  sandro_santos@gmail.com
2  Fernando      22  Estudante     fernandoFM@gmail.com
3     Pedro      32  Estudante        pedropp@gmail.com
4   Jeovani      22  Estudante   jeovanijp972@gmail.com
5     Cisco      18  Estudante      francisco@gmail.com

## Alterando toda a linha

In [16]:
## Com loc
## Tarefa: Mudar a linha 0 onde estava todos as informações do Carlos e inserir as informações do Fredy 

df_2.loc[0] = ["Fredy", 23, "Ciêntista de dados", "fredy@gmail.com"]
df_2

      Nomes  Idades           Profissão                   E-mail
0     Fredy      23  Ciêntista de dados          fredy@gmail.com
1    Sandro      20           Estudante  sandro_santos@gmail.com
2  Fernando      22           Estudante     fernandoFM@gmail.com
3     Pedro      32           Estudante        pedropp@gmail.com
4   Jeovani      22           Estudante   jeovanijp972@gmail.com
5     Cisco      18           Estudante      francisco@gmail.com

In [17]:
## Com iloc
## Tarefa: Mudar a linha 4 onde estava todos as informações do Jeovani e inserir as informações do Konde 

df_2.iloc[4] = ["Konde", 47, "Músico", "konde@gmail.com"]
df_2

      Nomes  Idades           Profissão                   E-mail
0     Fredy      23  Ciêntista de dados          fredy@gmail.com
1    Sandro      20           Estudante  sandro_santos@gmail.com
2  Fernando      22           Estudante     fernandoFM@gmail.com
3     Pedro      32           Estudante        pedropp@gmail.com
4     Konde      47              Músico          konde@gmail.com
5     Cisco      18           Estudante      francisco@gmail.com

### O indexador **loc** também pode ser utilizado para adicionar uma nova linha no final do DataFrame de forma similar.

In [18]:
df_2.loc[6] = ["Gerson", 28, "Estudante", "Gerson@gmail.com"]
df_2

      Nomes  Idades           Profissão                   E-mail
0     Fredy      23  Ciêntista de dados          fredy@gmail.com
1    Sandro      20           Estudante  sandro_santos@gmail.com
2  Fernando      22           Estudante     fernandoFM@gmail.com
3     Pedro      32           Estudante        pedropp@gmail.com
4     Konde      47              Músico          konde@gmail.com
5     Cisco      18           Estudante      francisco@gmail.com
6    Gerson      28           Estudante         Gerson@gmail.com

In [19]:
df_2.loc[0, "Profissão"] = "Engenheiro Cívil"
df_2

      Nomes  Idades         Profissão                   E-mail
0     Fredy      23  Engenheiro Cívil          fredy@gmail.com
1    Sandro      20         Estudante  sandro_santos@gmail.com
2  Fernando      22         Estudante     fernandoFM@gmail.com
3     Pedro      32         Estudante        pedropp@gmail.com
4     Konde      47            Músico          konde@gmail.com
5     Cisco      18         Estudante      francisco@gmail.com
6    Gerson      28         Estudante         Gerson@gmail.com

### **OBS:** O mesmo funciona com os indexadores **at** e **iat** que para alem de servirem para selecionar dados, eles podem ser usados para alterar certos elementos no dataset

In [20]:
## Exemplo aleterar o nome do fredy para cebolia usando o at

df_2.at[0, "Nomes"] = "Cebolinha"
df_2

       Nomes  Idades         Profissão                   E-mail
0  Cebolinha      23  Engenheiro Cívil          fredy@gmail.com
1     Sandro      20         Estudante  sandro_santos@gmail.com
2   Fernando      22         Estudante     fernandoFM@gmail.com
3      Pedro      32         Estudante        pedropp@gmail.com
4      Konde      47            Músico          konde@gmail.com
5      Cisco      18         Estudante      francisco@gmail.com
6     Gerson      28         Estudante         Gerson@gmail.com

In [21]:
## Alterar o email do cebolinha

df_2.iat[0,3] = "cebolinha@gmail.com"
df_2

       Nomes  Idades         Profissão                   E-mail
0  Cebolinha      23  Engenheiro Cívil      cebolinha@gmail.com
1     Sandro      20         Estudante  sandro_santos@gmail.com
2   Fernando      22         Estudante     fernandoFM@gmail.com
3      Pedro      32         Estudante        pedropp@gmail.com
4      Konde      47            Músico          konde@gmail.com
5      Cisco      18         Estudante      francisco@gmail.com
6     Gerson      28         Estudante         Gerson@gmail.com

In [22]:
# Exportando para csv para dar continuação a outra aula
df_2.to_csv("Info_Alunos.csv", index = False)

In [23]:
df_2.to_dict()

{'Nomes': {0: 'Cebolinha',
  1: 'Sandro',
  2: 'Fernando',
  3: 'Pedro',
  4: 'Konde',
  5: 'Cisco',
  6: 'Gerson'},
 'Idades': {0: 23, 1: 20, 2: 22, 3: 32, 4: 47, 5: 18, 6: 28},
 'Profissão': {0: 'Engenheiro Cívil',
  1: 'Estudante',
  2: 'Estudante',
  3: 'Estudante',
  4: 'Músico',
  5: 'Estudante',
  6: 'Estudante'},
 'E-mail': {0: 'cebolinha@gmail.com',
  1: 'sandro_santos@gmail.com',
  2: 'fernandoFM@gmail.com',
  3: 'pedropp@gmail.com',
  4: 'konde@gmail.com',
  5: 'francisco@gmail.com',
  6: 'Gerson@gmail.com'}}